Revit 2027 API
ViewScheduleExportOptions.ColumnHeaders Property
 How to export column headers. Default is MultipleRows.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportColumnHeaders ColumnHeaders { get; set; }
Public Property ColumnHeaders As ExportColumnHeaders
	Get
	Set
public:
property ExportColumnHeaders ColumnHeaders {
	ExportColumnHeaders get ();
	void set (ExportColumnHeaders value);
}
member ColumnHeaders : ExportColumnHeaders with get, set
Property Value
ExportColumnHeaders
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace